{
  "organization_name": "Adwwad",
  "assessment_date": "2025-05-27",
  "selected_regulation": "NPC",
  "selected_industry": "general",
  "responses": {
    "s0_q0": "Yes: The strategy is documented, covers all 12 NDP domains, and is reviewed/updated annually.",
    "s0_q1": "Partially: Some governance roles or committees exist, but not a full unit or office.",
    "s0_q2": "Partially: A policy exists but is not fully aligned or not widely communicated.",
    "s0_q3": "Yes: All roles and responsibilities are documented and assigned.",
    "s1_q0": "Yes: A comprehensive architecture exists, is documented, and regularly updated.",
    "s1_q1": "No: No EDM exists.",
    "s1_q2": "No: No models have been reviewed or approved by NPC.",
    "s2_q0": "Yes: The policy is published and aligned with national standards.",
    "s2_q1": "No: No data quality program exists.",
    "s2_q2": "Yes: Scorecards and KPIs are implemented and actively monitored.",
    "s3_q0": "Yes: A formal, published policy exists and is aligned with national standards.",
    "s3_q1": "No: No MDM program or plan exists.",
    "s3_q2": "Partially: Some coordination/approval has occurred, but not comprehensively.",
    "s4_q0": "No: No such policy or program exists.",
    "s4_q1": "Partially: Some digitalization efforts are underway, but not comprehensive.",
    "s5_q0": "Yes: A comprehensive catalog and metadata system is in place and maintained.",
    "s5_q1": "Partially: Some alignment exists, but not comprehensive.",
    "s6_q0": "No: No such policies exist.",
    "s6_q1": "Partially: Some solutions are compliant, but not all.",
    "s7_q0": "Yes: A formal, published policy exists.",
    "s7_q1": "Yes: All data sharing is secure and compliant.",
    "s7_q2": "Yes: Actively participates in the National Data Marketplace.",
    "s8_q0": "Yes: Programs are fully aligned and regularly reviewed.",
    "s8_q1": "Yes: A documented and structured portfolio exists.",
    "s8_q2": "Partially: Some compliance, but not comprehensive.",
    "s9_q0": "No: No data monetization opportunities identified.",
    "s9_q1": "No: No such program or plan.",
    "s10_q0": "Partially: Some compliance, but gaps remain.",
    "s10_q1": "Yes: All assets are classified per policy.",
    "s10_q2": "No: No automated systems.",
    "s11_q0": "Yes: A formal program is in place and active.",
    "s11_q1": "Yes: Curriculums and learning paths are defined and aligned."
  },
  "assessment_complete": false,
  "saved_at": "2025-05-27T16:28:27.561066"
}