{
  "organization_name": "Adwwad",
  "assessment_date": "2025-05-27",
  "selected_regulation": "NPC",
  "selected_industry": "general",
  "responses": {
    "s0_q0": "Yes: The strategy is documented, covers all 12 NDP domains, and is reviewed/updated annually.",
    "s0_q1": "Yes: A formal, dedicated unit or office is operational and has clear responsibilities.",
    "s0_q2": "Yes: The policy is published, communicated, and aligned with NDP requirements.",
    "s0_q3": "Yes: All roles and responsibilities are documented and assigned.",
    "s1_q0": "Yes: A comprehensive architecture exists, is documented, and regularly updated.",
    "s1_q1": "Yes: An EDM is in place, covering descriptive, diagnostic, predictive, and prescriptive analytics.",
    "s1_q2": "Yes: All models are reviewed and approved by NPC.",
    "s2_q0": "Yes: The policy is published and aligned with national standards.",
    "s2_q1": "Yes: A formal program is in place, with regular assessments and improvements.",
    "s2_q2": "Yes: Scorecards and KPIs are implemented and actively monitored.",
    "s3_q0": "Yes: A formal, published policy exists and is aligned with national standards.",
    "s3_q1": "Yes: A comprehensive MDM program and plan are operational.",
    "s3_q2": "Yes: All reference data/classifications are coordinated and approved by NPC.",
    "s4_q0": "Yes: Policy and program exist and cover the full lifecycle.",
    "s4_q1": "Yes: There is a clear plan and active implementation to digitize processes.",
    "s5_q0": "Yes: A comprehensive catalog and metadata system is in place and maintained.",
    "s5_q1": "Yes: Metadata structure fully aligns with NPC standards.",
    "s6_q0": "Yes: Policies are documented, compliant, and regularly reviewed.",
    "s6_q1": "Yes: All storage solutions are secure, scalable, and compliant.",
    "s7_q0": "Yes: A formal, published policy exists.",
    "s7_q1": "Yes: All data sharing is secure and compliant.",
    "s7_q2": "Yes: Actively participates in the National Data Marketplace.",
    "s8_q0": "Yes: Programs are fully aligned and regularly reviewed.",
    "s8_q1": "Yes: A documented and structured portfolio exists.",
    "s8_q2": "Yes: All official statistics follow NQAF and international standards.",
    "s9_q0": "Yes: Opportunities are identified and documented, with legal compliance.",
    "s9_q1": "Yes: A formal program and plan exist.",
    "s10_q0": "Yes: Full compliance with both laws.",
    "s10_q1": "Yes: All assets are classified per policy.",
    "s10_q2": "Yes: Automated systems are fully operational.",
    "s11_q0": "Yes: A formal program is in place and active.",
    "s11_q1": "Yes: Curriculums and learning paths are defined and aligned.",
    "s12_q0": "Yes: Regular audits and reviews are conducted and documented.",
    "s12_q1": "Yes: Mechanisms are documented, communicated, and enforced."
  },
  "assessment_complete": false,
  "saved_at": "2025-05-27T17:27:02.602094"
}