{
  "organization_name": "Omantel",
  "assessment_date": "2025-05-28",
  "selected_regulation": "NPC",
  "selected_industry": "General",
  "responses": {
    "s0_q1": "Yes: A formal, dedicated unit or office is operational and has clear responsibilities.",
    "s0_q2": "Partially: A policy exists but is not fully aligned or not widely communicated.",
    "s0_q3": "Yes: All roles and responsibilities are documented and assigned.",
    "s0_q0": "Yes: The strategy is documented, covers all 12 NDP domains, and is reviewed/updated annually.",
    "s1_q0": "Yes: A comprehensive architecture exists, is documented, and regularly updated.",
    "s1_q1": "Partially: An EDM exists but is incomplete or not fully utilized.",
    "s1_q2": "Partially: Some models have been submitted or reviewed, but not all.",
    "s2_q0": "Partially: A policy exists but is not fully aligned or not published.",
    "s2_q1": "Yes: A formal program is in place, with regular assessments and improvements.",
    "s2_q2": "Yes: Scorecards and KPIs are implemented and actively monitored.",
    "s3_q0": "Partially: A policy exists but is incomplete or not aligned.",
    "s3_q1": "Yes: A comprehensive MDM program and plan are operational.",
    "s3_q2": "Partially: Some coordination/approval has occurred, but not comprehensively.",
    "s4_q0": "Partially: Policy/program exists but is incomplete or covers only part of the lifecycle.",
    "s4_q1": "Yes: There is a clear plan and active implementation to digitize processes.",
    "s5_q0": "Yes: A comprehensive catalog and metadata system is in place and maintained.",
    "s5_q1": "Yes: Metadata structure fully aligns with NPC standards.",
    "s6_q0": "Yes: Policies are documented, compliant, and regularly reviewed.",
    "s6_q1": "Partially: Some solutions are compliant, but not all.",
    "s7_q0": "Yes: A formal, published policy exists.",
    "s7_q1": "No: Data sharing is not secure or compliant.",
    "s7_q2": "No: Does not participate.",
    "s8_q0": "Partially: Some alignment exists, but not comprehensive.",
    "s8_q1": "Partially: Some use cases exist, but not a full portfolio.",
    "s8_q2": "Yes: All official statistics follow NQAF and international standards.",
    "s9_q0": "Yes: Opportunities are identified and documented, with legal compliance.",
    "s9_q1": "Partially: Some efforts or plans exist, but not comprehensive.",
    "s10_q0": "Partially: Some compliance, but gaps remain.",
    "s10_q1": "Yes: All assets are classified per policy.",
    "s10_q2": "Partially: Some automation exists, but not comprehensive.",
    "s11_q0": "Yes: A formal program is in place and active.",
    "s11_q1": "Yes: Curriculums and learning paths are defined and aligned.",
    "s12_q0": "Yes: Regular audits and reviews are conducted and documented.",
    "s12_q1": "Yes: Mechanisms are documented, communicated, and enforced."
  },
  "assessment_complete": false,
  "saved_at": "2025-05-28T12:47:26.832322"
}